BaseKinoteatr/src/Documents/ПоступлениеПродукции/ПоступлениеПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеПродукции</name>
  <registerRecords>AccumulationRegister.ОстаткиПродукции</registerRecords>
  <attributes>
    <name>Кинотеатр</name>
    <type>
      <types>CatalogRef.Кинотеатры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BaseKinoteatr/src/AccumulationRegisters/ОстаткиПродукции/ОстаткиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПродукции</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Продукция</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кинотеатр</name>
    <type>
      <types>CatalogRef.Кинотеатры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BaseKinoteatr/src/Documents/ПоступлениеПродукции/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиПродукции Приход
	Движения.ОстаткиПродукции.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиПродукции.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Продукция;
		Движение.Кинотеатр = Кинотеатр;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;


КонецПроцедуры
